app/helpers/application_helper.rb

SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 4]]
---
  def notice_count
		if current_user.notifications.count == 0
			number_of_notices = nil
		else
			number_of_notices = "#{current_user.notifications.count}"

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
---
	def construct_notices
		notices = []
		current_user.notifications.each do |notice|