app/helpers/friendships_helper.rb

  def find_friendship(user, friend)
   f1 = Friendship.where('user_id = ? and friend_id = ?', user.id, friend.id)
---
SELECT "friendships".* FROM "friendships" WHERE (user_id = 2 and friend_id = 1) ORDER BY "friendships"."id" ASC LIMIT $1  [["LIMIT", 1]]