app/helpers/posts_helper.rb

  def liked?(id)
    !current_user.likes.map(&:post_id).include? id
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 3]]