app/views/posts/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
        <ul>
          <% p.comments.each do |c|%>