app/views/posts/_feed.html.erb

SELECT "posts".* FROM "posts"
---
    <%if current_user == u || current_user.friend?(u)%>
        <% u.posts.each do |p| %>