app/views/posts/_feed.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 2]]
---
          <% if p.likes %>
            <%= pluralize(p.likes.count, 'like')%>
          <% end %>
          <% if !current_user.likes.map(&:post_id).include? p.id %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
            <ul>
              <% p.comments.each do |c|%>