app/views/posts/_like.html.erb

      <% if p.likes %>
        <%= pluralize(p.likes.count, 'like')%>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]