app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["post_id", 1], ["content", "test"], ["created_at", "2019-12-19 16:24:14.368423"], ["updated_at", "2019-12-19 16:24:14.368423"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    if @comment.valid?
      @comment.save