app/controllers/friendships_controller.rb

  def create
    @friendship1 = Friendship.new(friendship_params)
    @friendship1.user_id = current_user.id
    @friendship1.sender_id = current_user.id
    @friendship2 = Friendship.new(sender_id: @friendship1.sender_id, user_id: @friendship1.friend_id, friend_id: @friendship1.user_id)

    if @friendship1.valid? && @friendship2.valid?
      @friendship1.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", "2019-12-20 09:38:34.765328"], ["updated_at", "2019-12-20 09:38:34.765328"]]

  def update
    friendship1 = Friendship.where(id: params[:id][0])
    friendship2 = Friendship.where(id: params[:id][1])
    friendship1.update(confirmed: true)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "friendships" SET "confirmed" = $1 WHERE "friendships"."id" = $2  [["confirmed", true], ["id", 2]]

  def destroy
    Friendship.where(id: params[:id]).destroy_all
    @friendship = Friendship.find_by(id: params[:id].to_i)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 15]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def send_notice
    notice = @friendship.friend.notifications.build(other_user_id: current_user.id,
                                                    type_id: @friendship.id)
    notice.save
---
INSERT INTO "notifications" ("user_id", "other_user_id", "type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["other_user_id", 3], ["type_id", 1], ["created_at", "2019-12-22 14:34:04.516542"], ["updated_at", "2019-12-22 14:34:04.516542"]]