app/controllers/likes_controller.rb

  def create
    @like = Like.new(like_params)

    if @like.valid?
      @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["post_id", 1], ["created_at", "2019-12-19 14:30:02.354185"], ["updated_at", "2019-12-19 14:30:02.354185"]]