app/controllers/notifications_controller.rb

DELETE FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
---
  def destroy
  	current_user.notifications.delete_all