app/controllers/posts_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @post = Post.new
    @users = User.all