app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I am tired really"], ["created_at", "2019-12-17 16:04:12.738106"], ["updated_at", "2019-12-17 16:04:12.738106"], ["user_id", 2]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.valid?
      @post.save