app/controllers/users_controller.rb

  def index
    @users = User.all - [current_user]
---
SELECT "users".* FROM "users"